[net]
#Testing
batch=1
subdivisions=1
#Training
#batch=64
#subdivisions=16
width=288
height=288
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
quantized_switch=2
bitwidth=8
max_in=7
max_out=2
max_bias=3
max_w=2
batch_normalize=0
filters=32
size=3
stride=1
pad=1
activation=leaky

#Downsample

[convolutional]
quantized_switch=2
bitwidth=8
max_in=2
max_out=3
max_bias=3
max_w=7
batch_normalize=0
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=4
max_bias=5
max_w=6
batch_normalize=0
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=2
max_bias=5
max_w=6
batch_normalize=0
filters=64
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=3
from=-3
activation=linear

#Downsample

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=3
max_bias=5
max_w=7
batch_normalize=0
filters=128
size=3
stride=2
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=3
max_bias=5
max_w=7
batch_normalize=0
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=3
max_bias=2
max_w=7
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=5
max_w=7
batch_normalize=0
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=5
max_w=7
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear

#Downsample

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=4
max_w=8
batch_normalize=0
filters=256
size=3
stride=2
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=4
max_bias=5
max_w=7
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=6
max_w=8
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=5
max_w=7
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=5
max_bias=6
max_w=8
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=5
max_w=6
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=4
max_bias=5
max_w=7
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=5
max_w=7
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=4
max_bias=6
max_w=8
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear


[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=4
max_w=7
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=5
max_w=7
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=3
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=4
max_bias=5
max_w=7
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=5
max_w=7
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=3
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=3
max_bias=5
max_w=8
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=3
max_bias=5
max_w=6
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=3
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=3
max_bias=4
max_w=8
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=2
max_bias=5
max_w=7
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=3
from=-3
activation=linear

#Downsample

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=3
max_bias=4
max_w=9
batch_normalize=0
filters=512
size=3
stride=2
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=3
max_bias=5
max_w=6
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=5
max_bias=5
max_w=9
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear


[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=5
max_w=6
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=6
max_w=9
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear


[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=6
max_w=7
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=6
max_w=8
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear


[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=5
max_w=7
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=6
max_w=7
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=6
max_w=8
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=6
max_w=7
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=3
from=-3
activation=linear


[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=4
max_bias=6
max_w=8
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=5
max_w=7
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=3
from=-3
activation=linear


[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=4
max_bias=6
max_w=8
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=6
max_w=8
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=3
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=4
max_bias=6
max_w=8
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=6
max_w=7
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=3
from=-3
activation=linear

#Downsample

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=4
max_bias=5
max_w=10
batch_normalize=0
filters=1024
size=3
stride=2
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=2
max_bias=6
max_w=6
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=2
max_out=4
max_bias=5
max_w=8
batch_normalize=0
filters=1024
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=5
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=4
max_bias=6
max_w=6
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=6
max_w=8
batch_normalize=0
filters=1024
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=6
max_w=7
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=4
max_bias=6
max_w=7
batch_normalize=0
filters=1024
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=6
max_w=8
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=3
max_bias=6
max_w=6
batch_normalize=0
filters=1024
size=3
stride=1
pad=1
activation=leaky

[shortcut]
bitwidth=8
quantized_switch=2
max_out=4
from=-3
activation=linear

######################

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=7
max_w=8
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=6
max_w=8
batch_normalize=0
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=7
max_w=8
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=6
max_w=8
batch_normalize=0
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=4
max_bias=7
max_w=8
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=5
max_w=8
batch_normalize=0
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=3
max_bias=5
max_w=7
size=1
stride=1
pad=1
filters=255
activation=linear


[yolo]
mask=6,7,8
anchors=10,13,16,30,33,23,30,61,62,45,59,119,116,90,156,198,373,326
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1


[route]
bitwidth=8
quantized_switch=2
max_out=4
layers=-4

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=6
max_w=7
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
bitwidth=8
quantized_switch=2
max_out=3
layers=-1,61



[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=4
max_bias=7
max_w=8
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=6
max_w=9
batch_normalize=0
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=4
max_bias=7
max_w=8
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=5
max_bias=5
max_w=8
batch_normalize=0
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=5
max_bias=6
max_w=7
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=4
max_bias=5
max_w=8
batch_normalize=0
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=5
max_w=7
size=1
stride=1
pad=1
filters=255
activation=linear


[yolo]
mask=3,4,5
anchors=10,13,16,30,33,23,30,61,62,45,59,119,116,90,156,198,373,326
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1



[route]
bitwidth=8
quantized_switch=2
max_out=5
layers=-4

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=3
max_bias=6
max_w=7
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
bitwidth=8
quantized_switch=2
max_out=3
layers=-1,36



[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=3
max_bias=6
max_w=9
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=3
max_out=5
max_bias=6
max_w=8
batch_normalize=0
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=5
max_out=4
max_bias=7
max_w=7
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=6
max_w=8
batch_normalize=0
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=5
max_w=7
batch_normalize=0
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=4
max_bias=5
max_w=7
batch_normalize=0
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
quantized_switch=2
bitwidth=8
max_in=4
max_out=3
max_bias=5
max_w=6
size=1
stride=1
pad=1
filters=255
activation=linear


[yolo]
mask=0,1,2
anchors=10,13,16,30,33,23,30,61,62,45,59,119,116,90,156,198,373,326
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

